In [3]:
import pandas as pd

In [4]:
df = pd.read_csv(r"C:\Users\umer\Downloads\Softwork Technologies - Sheet1.csv")

In [5]:
df

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,61
...,...,...,...,...,...,...,...,...,...,...,...,...
23489,5973,Technology,region_17,Master's & above,m,other,3,40,5.0,5,0,89
23490,65237,Sales & Marketing,region_2,Bachelor's,m,sourcing,2,43,1.0,14,0,52
23491,67672,Technology,region_17,Bachelor's,m,other,1,29,NaN,1,0,85
23492,77460,Sales & Marketing,region_2,Bachelor's,f,sourcing,1,35,3.0,3,0,52
23493,67317,Technology,region_22,Master's & above,m,other,4,40,3.0,12,0,77

In [5]:
# find duplicates:

In [6]:
duplicate = df.duplicated().sum()

In [7]:
duplicate

np.int64(4)

In [8]:
# how to see duplicate data

df[df.duplicated()]

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
23490,65237,Sales & Marketing,region_2,Bachelor's,m,sourcing,2,43,1.0,14,0,52
23491,67672,Technology,region_17,Bachelor's,m,other,1,29,NaN,1,0,85
23492,77460,Sales & Marketing,region_2,Bachelor's,f,sourcing,1,35,3.0,3,0,52
23493,67317,Technology,region_22,Master's & above,m,other,4,40,3.0,12,0,77

In [18]:
# remove duplicate data
remove_duplicate = df.drop_duplicates(inplace=True)

In [9]:
df.duplicated().sum()

np.int64(4)

In [20]:
# missing data

In [10]:
df.isnull().sum()

employee_id                0
department                 0
region                     0
education               1034
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    1813
length_of_service          0
awards_won                 0
avg_training_score         0
dtype: int64

In [11]:
df['education'] = df['education'].fillna('unknown')

In [12]:
df['education']

0              Bachelor's
1              Bachelor's
2              Bachelor's
3              Bachelor's
4              Bachelor's
               ...
23489    Master's & above
23490          Bachelor's
23491          Bachelor's
23492          Bachelor's
23493    Master's & above
Name: education, Length: 23494, dtype: object

In [13]:
df.isnull().sum()

employee_id                0
department                 0
region                     0
education                  0
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    1813
length_of_service          0
awards_won                 0
avg_training_score         0
dtype: int64

In [14]:
df['previous_year_rating'] = df['previous_year_rating'].fillna('0')

In [16]:
df.isnull().sum()

employee_id             0
department              0
region                  0
education               0
gender                  0
recruitment_channel     0
no_of_trainings         0
age                     0
previous_year_rating    0
length_of_service       0
awards_won              0
avg_training_score      0
dtype: int64

In [18]:
df.to_excel('etl.xlsx',index=False)

In [19]:
import pandas as pd
from sqlalchemy import create_engine

# Your DataFrame
df['education'] = df['education'].fillna('unknown')

# Database credentials
username = 'root'
password = '3189'
host = 'localhost'
port = '3306'
database = 'pipeline'

# Create the engine
engine = create_engine(f'mysql+pymysql://{username}:{password}@{host}:{port}/{database}')

# Save the DataFrame to the MySQL database
df.to_sql('education_data', con=engine, if_exists='replace', index=False)

23494

In [20]:
git init

SyntaxError: invalid syntax (2830201818.py, line 1)